const locale = {
    documentTitle: 'Артём Лабоскин',

    header: {
        nav: {
            about: 'Обо мне',
            skills: 'Навыки',
            projects: 'Проекты',
            contact: 'Контакты'
        },
        language: {
            code: 'en',
            name: 'English'
        }
    },
    hero: {
        prefix: 'Привет, меня зовут',
        primaryHeading: 'Артём Лабоскин.',
        secondaryHeading: 'Я – фронтенд разработчик.',
        description: 'Я разрабатываю веб-приложения, которые не только имеют высокую производительность и качество кода, но и предоставляют исключительный пользовательский опыт.',
        button: 'Связаться со мной'
    },
    about: {
        title: 'Обо мне',
        text: {
            first: "Привет! Я - Артём Лабоскин, фронтенд разработчик из <0>Казани</0>.",
            second: "С раннего детства я увлекался информационными технологиями и программированием. " +
                "Мне нравится разрабатывать ПО, которое решает реальные проблемы и делает мир лучше. " +
                "Как разработчик, я стремлюсь создавать приложения, которые имеют производительный, чистый и масштабируемый код и предоставляют лучший пользовательский опыт.",
            third: "В июне 2020 я закончил <0>КФУ</0> по специальности Фундаментальная Информатика и ИТ и начал углублённо изучать JavaScript, React и другие технологии и инструменты чтобы построить успешную карьеру в качестве фронтенд разработчика.",
            fourth: "Помимо программирования, я люблю путешествовать и изучать мир. Мой опыт проживания и работы в США в течение полугода в 2019 научил меня с легкостью общаться и работать вместе с людьми из разных стран."
        },
        photoAlt: 'Моё фото'
    },
    skills: {
        title: 'Мои навыки',
        frontend: 'Front-end',
        backend: 'Back-end',
        other: 'Прочее',
        some: 'Немного'
    },
    projects: {
        title: 'Последние проекты',
        descriptions: {
            'portfolio': 'Небольшое React приложение без сервера. Онлайн версия моего резюме/портфолио, которое вы сейчас читаете.',
            'ezlingua': 'Веб-приложение для изучения иностранным языком при помощи чтения короткий рассказов и выполнения различных словарных тренировок от словарных карточек до конструктора слов.',
            'ezlingua-php': 'Legacy-версия проекта ezlingua, разработанная в рамках дипломной работы в университете и в последствии послужившая в качестве прототипа для нового приложения на React/NodeJS.',
            'soldr': 'Сайт для поиска и размещения частных объявлений о недвижимости, транспорте, товарах и услугах.'
        }
    },
    contact: {
        overline: 'Что дальше?',
        title: 'Связаться со мной',
        description: 'Lorem ipsum dolor sit amet, consectetur adipisicing elit. Consequatur deserunt itaque laborum qui similique, sit tempore veritatis voluptates! Aspernatur fugiat neque nesciunt officia omnis, voluptatem.',
        button: 'Написать мне'
    },
    months: {
        january: 'Января',
        february: 'Февраль',
        march: 'Март',
        april: 'Апрель',
        may: 'Май',
        june: 'Июнь',
        july: 'Июль',
        august: 'Август',
        september: 'Сентябрь',
        october: 'Октябрь',
        november: 'Ноябрь',
        december: 'Декабрь'
    }
}

export default locale