export const ru = {
  documentTitle: 'Артём Лабоскин',
  resumeButton: 'Резюме',
  header: {
    nav: {
      about: 'Обо мне',
      skills: 'Навыки',
      experience: 'Опыт работы',
      projects: 'Проекты',
      contact: 'Контакты',
    },
    language: {
      code: 'en',
      name: 'English',
    },
  },
  hero: {
    prefix: 'Привет, меня зовут',
    primaryHeading: 'Артём Лабоскин.',
    secondaryHeading: 'Я – фронтенд разработчик.',
    description:
      'Я разрабатываю веб-приложения, которые не только имеют высокопроизводительный и чистый код, но и предоставляют исключительный пользовательский опыт.',
    button: 'Связаться со мной',
  },
  about: {
    title: 'Обо мне',
    text: {
      first: 'Привет! Я - Артём Лабоскин, фронтенд разработчик из <0>г. Белград, Сербия</0>.',
      second:
        'С раннего детства я увлекался информационными технологиями и программированием. ' +
        'Мне нравится разрабатывать ПО, которое решает реальные проблемы и делает мир лучше. ' +
        'Как разработчик, я стремлюсь создавать приложения, которые имеют производительный, чистый и масштабируемый код и предоставляют лучший пользовательский опыт.',
      third:
        'После окончания в июне 2020 <0>Казанского Федерального Университета</0> по специальности Фундаментальная Информатика, я успел поработать в разнообразных ИТ компаниях из разных стран и успешно продемонстрировал высокие умения в разработке веб-приложений',
    },
    photoAlt: 'Моё фото',
  },
  skills: {
    title: 'Мои навыки',
    frontend: 'Фронтенд',
    backend: 'Бэкенд',
    other: 'Прочее',
  },
  experience: {
    title: 'Опыт работы',
    acquire: {
      position: 'Фронтенд Разработчик',
      period: `Февраль 2022 – Настоящее время`,
      location: 'Сан Франциско, США (удалённо)',
      description:
        '<0>Спроектировал архитектуру и построил с нуля виджет онлайн-чата поддержки клиентов</0>' +
        '<0>Разработана многофункциональная платформа для агентов техподдержки с живым чатом, информационными панелями в реальном времени и видеозвонками с использованием архитектуры микро-фронтендов</0>' +
        '<0>Активно участвовал в архитектурных дискуссиях вместе с продуктовыми и дизайнерскими командами, что оказало существенное влияние на путь разработки продукта</0>',
    },
    dasreda: {
      position: 'Фронтенд Разработчик',
      period: `Сентябрь 2021 – Январь 2022`,
      location: 'Москва, Россия (удалённо)',
      description:
        '<0>Руководил успешным переходом крупномасштабной устаревшей кодовой базы Javascript на TypeScript и передовые технологии, что привело к повышению эффективности и удобства сопровождения</0>' +
        '<0>Организовывал и проводил семинары по TypeScript и современным передовым методам разработки программного обеспечения для членов команды</0>' +
        '<0>Сокращение времени сборки проекта на 60 % и оптимизация размера пакета и разделения кода, что экономит более 400 человеко-часов в год для компании и значительно ускоряет разработку, развертывание и скорость загрузки приложения</0>',
    },
    sosivio: {
      position: 'Фронтенд Разработчик',
      period: `Декабрь 2020 – Август 2021`,
      location: 'Тель Авив, Израиль (удалённо)',
      description:
        '<0>Разработал высокопроизводительный дэшборд на React + TypeScript при взаимодействии с AI и бэкенд командами.</0>' +
        '<0>Создал масштабируемую и надёжную кодовой базы с 95%+ тестовым покрытием</0>' +
        '<0>Разработал UI-Kit, состоящего из реиспользуемых компонентов, для стандартизации интерфейса и ускорения разработки</0>',
    },
  },
  projects: {
    title: 'Последние проекты',
    descriptions: {
      portfolio:
        'Небольшое React приложение без сервера. Онлайн версия моего резюме/портфолио, которое вы сейчас читаете.',
      ezlingua:
        'Веб-приложение для изучения иностранных языков при помощи чтения коротких рассказов и выполнения различных словарных тренировок от словарных карточек до конструктора слов.',
      'ezlingua-php':
        'Legacy-версия проекта ezlingua, разработанная в рамках дипломной работы в университете и в последствии послужившая в качестве прототипа для нового приложения на React/NodeJS.',
      soldr:
        'Сайт для поиска и размещения частных объявлений о недвижимости, транспорте, товарах и услугах.',
    },
  },
  contact: {
    overline: 'Что дальше?',
    title: 'Связаться со мной',
    description:
      'Если у вас есть вопросы, или вы просто хотите поздороваться — свяжитесь со мной, и я незамедлительно отвечу.',
    button: 'Написать мне',
  },
  months: {
    january: 'Января',
    february: 'Февраль',
    march: 'Март',
    april: 'Апрель',
    may: 'Май',
    june: 'Июнь',
    july: 'Июль',
    august: 'Август',
    september: 'Сентябрь',
    october: 'Октябрь',
    november: 'Ноябрь',
    december: 'Декабрь',
  },
};
