export const ru = {
  documentTitle: 'Артём Лабоскин',

  header: {
    nav: {
      about: 'Обо мне',
      skills: 'Навыки',
      experience: 'Опыт работы',
      projects: 'Проекты',
      contact: 'Контакты',
    },
    language: {
      code: 'en',
      name: 'English',
    },
  },
  hero: {
    prefix: 'Привет, меня зовут',
    primaryHeading: 'Артём Лабоскин.',
    secondaryHeading: 'Я – фронтенд разработчик.',
    description:
      'Я разрабатываю веб-приложения, которые не только имеют высокопроизводительный и чистый код, но и предоставляют исключительный пользовательский опыт.',
    button: 'Связаться со мной',
  },
  about: {
    title: 'Обо мне',
    text: {
      first: 'Привет! Я - Артём Лабоскин, фронтенд разработчик из <0>Казани</0>.',
      second:
        'С раннего детства я увлекался информационными технологиями и программированием. ' +
        'Мне нравится разрабатывать ПО, которое решает реальные проблемы и делает мир лучше. ' +
        'Как разработчик, я стремлюсь создавать приложения, которые имеют производительный, чистый и масштабируемый код и предоставляют лучший пользовательский опыт.',
      third:
        'В июне 2020 я окончил <0>КФУ</0> по специальности Фундаментальная Информатика и ИТ и начал углублённо изучать JavaScript, React и другие технологии и инструменты чтобы построить успешную карьеру в качестве фронтенд разработчика.',
      fourth:
        'Помимо программирования, я люблю путешествовать и изучать мир. Мой опыт проживания и работы в США в течение полугода в 2019 научил меня с легкостью общаться и работать вместе с людьми из разных стран.',
    },
    photoAlt: 'Моё фото',
  },
  skills: {
    title: 'Мои навыки',
    frontend: 'Фронтенд',
    backend: 'Бэкенд',
    other: 'Прочее',
  },
  experience: {
    title: 'Опыт работы',
    sosivio: {
      position: 'Фронтенд Разработчик',
      period: `Декабрь 2020 - Настоящее время`,
      description:
        '<0>Разработка высокопроизводительный дэшборд на React + TypeScript при взаимодействии с AI и бэкенд командами.</0>' +
        '<0>Создание масштабируемой и надёжной кодовой базы с 95%+ тестовым покрытием</0>' +
        '<0>Разработка UI-Kit, состоящего из реиспользуемых компонентов, для стандартизации интерфейса и ускорения разработки</0>',
    },
  },
  projects: {
    title: 'Последние проекты',
    descriptions: {
      portfolio:
        'Небольшое React приложение без сервера. Онлайн версия моего резюме/портфолио, которое вы сейчас читаете.',
      ezlingua:
        'Веб-приложение для изучения иностранных языков при помощи чтения коротких рассказов и выполнения различных словарных тренировок от словарных карточек до конструктора слов.',
      'ezlingua-php':
        'Legacy-версия проекта ezlingua, разработанная в рамках дипломной работы в университете и в последствии послужившая в качестве прототипа для нового приложения на React/NodeJS.',
      soldr:
        'Сайт для поиска и размещения частных объявлений о недвижимости, транспорте, товарах и услугах.',
    },
  },
  contact: {
    overline: 'Что дальше?',
    title: 'Связаться со мной',
    description:
      'В данный момент я не заинтересован в поиске работы, однако я всегда открыт к общению. Если у вас есть вопросы, или вы просто хотите поздороваться — свяжитесь со мной, и я незамедлительно отвечу.',
    button: 'Написать мне',
  },
  months: {
    january: 'Января',
    february: 'Февраль',
    march: 'Март',
    april: 'Апрель',
    may: 'Май',
    june: 'Июнь',
    july: 'Июль',
    august: 'Август',
    september: 'Сентябрь',
    october: 'Октябрь',
    november: 'Ноябрь',
    december: 'Декабрь',
  },
};
